hackathon/src/Enums/ИсточникиОбращений/ИсточникиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиОбращений</name>
  <enumValues>
    <name>РучноеСоздание</name>
  </enumValues>
  <enumValues>
    <name>СозданиеИзФормыОбработки</name>
  </enumValues>
  <enumValues>
    <name>Телеграм</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
</mdclass:Enum>

hackathon/src/Catalogs/Обращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Обращения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТональностьОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешний</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

hackathon/src/HTTPServices/PUT_Request/Module.bsl
//@НаСервере
//структура ОбращениеСтруктура
//    обз пер ЗаголовокОбращения: Строка
//    обз пер ТекстОбращения: Строка
//    обз пер Код: Строка
//    обз пер ДатаСоздания: ДатаВремя
//    обз пер ФиоИсполнителя: Строка
//    обз пер ФиоАвтора: Строка
//    обз пер Статус: Строка
//    обз пер УуидЭлемента: Строка
//    обз пер УуидПредприятия: Строка
//    обз пер КомментарииТЧ: Массив<СтруктураТЧ>
//;

//@НаСервере
//структура СтруктураТЧ
//    обз пер Дата: ДатаВремя
//    обз пер Комментарий: Строка
//    обз пер ФиоАвтор: Строка
//;

Функция requestPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Попытка
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8"); 
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		
		СтруктураЗапр = ПрочитатьJSON(ЧтениеJSON, Истина); 
		//МассивНаимМОЛ = СтруктураЗапр["НаимМОЛ"]; 
		
		УуидПредприятия = СтруктураЗапр["УуидПредприятия"];
		
		Ууид = Новый УникальныйИдентификатор(УуидПредприятия);
		
		ОбращенияСсылка = Справочники.Обращения.ПолучитьСсылку(Ууид);
		
		Если ОбращенияСсылка.Пустая() Тогда 
			ОбращенияОбъект = Справочники.Обращения.СоздатьЭлемент();	
		Иначе
			ОбращенияОбъект = ОбращенияСсылка.ПолучитьОбъект();	
		КонецЕсли;
		
		ОбращенияОбъект.Наименование = СтруктураЗапр["ЗаголовокОбращения"];
		ОбращенияОбъект.ТекстОбращения = СтруктураЗапр["ТекстОбращения"];
		ОбращенияОбъект.Код = СтруктураЗапр["Код"];       
		ОбращенияОбъект.ДатаСоздания = СтруктураЗапр["ДатаСоздания"];    
		ОбращенияОбъект.Статус = СтруктураЗапр["Статус"];
		ОбращенияОбъект.УуидЭлемента = СтруктураЗапр["УуидЭлемента"]; 
		ОбращенияОбъект.УуидПредприятия = СтруктураЗапр["УуидПредприятия"];
		ОбращенияОбъект.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию(СтруктураЗапр["ФиоИсполнителя"]); 
		//ОбращенияОбъект.Автор = Справочники.КлиентыCRM.НайтиПоНаименованию(СтруктураЗапр["ФиоАвтора"]);
		
		ОбращенияОбъект.Источник = Перечисления.ИсточникиОбращений.Сайт;
		
		ОбращенияОбъект.Комментарии.Очистить();
		Для Каждого Элем Из СтруктураЗапр["КомментарииТЧ"] Цикл
			НовСтр = ОбращенияОбъект.Комментарии.Добавить();
			//НовСтр.Автор = Справочники.КлиентыCRM.НайтиПоНаименованию(СтруктураЗапр["ФиоАвтор"]);
			НовСтр.Дата = Дата(Элем["Дата"]);
			НовСтр.Комментарий = Элем["Комментарий"]; 
		КонецЦикла;
		ОбращенияОбъект.Записать();
		
		Если ОбращенияОбъект.УуидПредприятия = "00000000-0000-0000-0000-000000000000" ИЛИ ПустаяСтрока(ОбращенияОбъект.УуидПредприятия) Тогда 
			ОбращенияОбъект.УуидПредприятия = Строка(ОбращенияОбъект.Ссылка.УникальныйИдентификатор());	
			ОбращенияОбъект.Записать();
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура("Успешно, УуидПредприятия", Истина, ОбращенияОбъект.УуидПредприятия);
		
		JSONответ = Новый ЗаписьJSON;
		JSONответ.УстановитьСтроку();
		ЗаписатьJSON(JSONответ, СтруктураОтвета); 
		Отв = JSONответ.Закрыть(); 
		
		Ответ.УстановитьТелоИзСтроки(Отв);
		Возврат Ответ;  
		
	Исключение 
		
		СтруктураОтвета = Новый Структура("Успешно, УуидПредприятия", Ложь, "");

		JSONответ = Новый ЗаписьJSON;
		JSONответ.УстановитьСтроку();
		ЗаписатьJSON(JSONответ, СтруктураОтвета); 
		Отв = JSONответ.Закрыть(); 
		
		Ответ.УстановитьТелоИзСтроки(Отв);
		Возврат Ответ;
		
	КонецПопытки;	
КонецФункции
